In [1]:
import pandas as pd

In [72]:
dist_ctrs = pd.read_csv("../data/raw/distribution_centers.csv")
dist_ctrs.head()

   id            name  latitude  longitude
0   1      Memphis TN   35.1174   -89.9711
1   2      Chicago IL   41.8369   -87.6847
2   3      Houston TX   29.7604   -95.3698
3   4  Los Angeles CA   34.0500  -118.2500
4   5  New Orleans LA   29.9500   -90.0667

In [73]:
# first fix the new york name
dist_ctrs['name'] = dist_ctrs['name'].replace('Port Authority of New York/New Jersey NY/NJ', 'New York NY')
dist_ctrs

   id             name  latitude  longitude
0   1       Memphis TN   35.1174   -89.9711
1   2       Chicago IL   41.8369   -87.6847
2   3       Houston TX   29.7604   -95.3698
3   4   Los Angeles CA   34.0500  -118.2500
4   5   New Orleans LA   29.9500   -90.0667
5   6      New York NY   40.6340   -73.7834
6   7  Philadelphia PA   39.9500   -75.1667
7   8        Mobile AL   30.6944   -88.0431
8   9    Charleston SC   32.7833   -79.9333
9  10      Savannah GA   32.0167   -81.1167

In [74]:
# break apart name into city and state and drop name
dist_ctrs[['city', 'state']] = dist_ctrs['name'].str.rsplit(pat=' ', n=1, expand=True)
dist_ctrs = dist_ctrs.drop(columns='name')
dist_ctrs

   id  latitude  longitude          city state
0   1   35.1174   -89.9711       Memphis    TN
1   2   41.8369   -87.6847       Chicago    IL
2   3   29.7604   -95.3698       Houston    TX
3   4   34.0500  -118.2500   Los Angeles    CA
4   5   29.9500   -90.0667   New Orleans    LA
5   6   40.6340   -73.7834      New York    NY
6   7   39.9500   -75.1667  Philadelphia    PA
7   8   30.6944   -88.0431        Mobile    AL
8   9   32.7833   -79.9333    Charleston    SC
9  10   32.0167   -81.1167      Savannah    GA

In [3]:
events = pd.read_csv("../data/raw/events.csv")
events.head()

,id,user_id,sequence_number,session_id,created_at,ip_address,city,state,postal_code,browser,traffic_source,uri,event_type
0,2198523,NaN,3,83889ed2-2adc-4b9a-af5d-154f6998e778,2021-06-17 17:30:00+00:00,138.143.9.202,São Paulo,São Paulo,02675-031,Chrome,Adwords,/cancel,cancel
1,1773216,NaN,3,7a3fc3f2-e84f-44fe-8876-eff76741f7a3,2020-08-07 08:41:00+00:00,85.114.141.79,Santa Isabel,São Paulo,07500-000,Safari,Adwords,/cancel,cancel
2,2380515,NaN,3,13d9b2fb-eee1-43fd-965c-267b38dd7125,2021-02-15 18:48:00+00:00,169.250.255.132,Mairiporã,São Paulo,07600-000,IE,Adwords,/cancel,cancel
3,2250597,NaN,3,96f1d44e-9621-463c-954c-d8deb7fffe7f,2022-03-30 10:56:00+00:00,137.25.222.160,Cajamar,São Paulo,07750-000,Chrome,Adwords,/cancel,cancel
4,1834446,NaN,3,d09dce10-a7cb-47d3-a9af-44975566fa03,2019-09-05 01:18:00+00:00,161.114.4.174,São Paulo,São Paulo,09581-680,Chrome,Email,/cancel,cancel

In [118]:
# missing user_id values
# attempt to identify missing user_ids by finding other events with present user_ids within the same session
# as we can see there are no events with missing user_id sharing the same session as a event with a present user_id
missing = events[events['user_id'].isna()]
present = events[~events['user_id'].isna()]
len(set(missing['session_id']) & set(present['session_id']))

0

In [ ]:
# missing city values
"""
- using user_id
- using postal_code or ip_address -> this is for later enrichment. Just document it's impact.
"""

In [144]:
# first try using user_id

# user_ids of all events with missing city
missing_city_users = set(events[events['city'].isna()]['user_id'])

# user_ids all users with non-missing city
city_present_users = set(users[~users['city'].isna()]['id'].values)
missing_city_users & city_present_users

set()

In [4]:
inv_items = pd.read_csv("../data/raw/inventory_items.csv")
inv_items.head()

,id,product_id,created_at,sold_at,cost,product_category,product_name,product_brand,product_retail_price,product_department,product_sku,product_distribution_center_id
0,67971,13844,2022-07-02 07:09:20+00:00,2022-07-24 06:33:20+00:00,2.76804,Accessories,(ONE) 1 Satin Headband,Funny Girl Designs,6.99,Women,2A3E953A5E3D81E67945BCE5519F84C8,7
1,67972,13844,2023-12-20 03:28:00+00:00,NaN,2.76804,Accessories,(ONE) 1 Satin Headband,Funny Girl Designs,6.99,Women,2A3E953A5E3D81E67945BCE5519F84C8,7
2,67973,13844,2023-06-04 02:53:00+00:00,NaN,2.76804,Accessories,(ONE) 1 Satin Headband,Funny Girl Designs,6.99,Women,2A3E953A5E3D81E67945BCE5519F84C8,7
3,72863,13844,2021-10-16 22:58:52+00:00,2021-11-22 02:19:52+00:00,2.76804,Accessories,(ONE) 1 Satin Headband,Funny Girl Designs,6.99,Women,2A3E953A5E3D81E67945BCE5519F84C8,7
4,72864,13844,2021-08-07 16:33:00+00:00,NaN,2.76804,Accessories,(ONE) 1 Satin Headband,Funny Girl Designs,6.99,Women,2A3E953A5E3D81E67945BCE5519F84C8,7

In [210]:
# product_retail_price
inv_items['product_retail_price'] = inv_items['product_retail_price'].round(2)

In [ ]:
# sold_at
"""
inventory items connected to order items
- not enough information to connect to another value in another table
"""

In [ ]:
# product_name and product_brand
"""
- look at product table
"""

In [186]:
# products with present names
present_product_ids = set(products[~products['name'].isna()]['id'])

# product_id of investory items without product name
missing_product_ids = set(inv_items[inv_items['product_name'].isna()]['product_id'])

present_product_ids & missing_product_ids

set()

In [200]:
# products with present brands
present_product_ids = set(products[~products['brand'].isna()]['id'])

# product_id of investory items without product brand
missing_product_ids = set(inv_items[inv_items['product_brand'].isna()]['product_id'])

present_product_ids & missing_product_ids

set()

In [167]:
order_items = pd.read_csv("../data/raw/order_items.csv")
order_items.head()

,id,order_id,user_id,product_id,inventory_item_id,status,created_at,shipped_at,delivered_at,returned_at,sale_price
0,152013,104663,83582,14235,410368,Cancelled,2023-05-07 06:08:40+00:00,NaN,NaN,NaN,0.02
1,40993,28204,22551,14235,110590,Complete,2023-03-14 03:47:21+00:00,2023-03-15 22:57:00+00:00,2023-03-18 01:08:00+00:00,NaN,0.02
2,51224,35223,28215,14235,138236,Complete,2023-12-05 13:25:30+00:00,2023-12-06 01:20:00+00:00,2023-12-10 10:04:00+00:00,NaN,0.02
3,36717,25278,20165,14235,99072,Shipped,2023-12-22 20:48:19+00:00,2023-12-24 16:44:00+00:00,NaN,NaN,0.02
4,131061,90241,71954,14235,353798,Shipped,2022-06-19 16:57:59+00:00,2022-06-19 19:29:00+00:00,NaN,NaN,0.02

In [ ]:
"""
Missing shipped_at dates
"""

In [293]:
# missing shipped_at dates: align with orders
df = order_items.merge(orders, on='order_id')
sum(df['shipped_at_x'].isna() != df['shipped_at_y'].isna())

0

In [297]:
# missing delivered_at dates: align with orders
df = order_items.merge(orders, on='order_id')
sum(df['delivered_at_x'].isna() != df['delivered_at_y'].isna())

0

In [309]:
# missing returned_at dates: aligned with orders
df = order_items.merge(orders, on='order_id')
sum(df['returned_at_x'].isna() != df['returned_at_y'].isna())

0

In [294]:
orders

,order_id,user_id,status,gender,created_at,returned_at,shipped_at,delivered_at,num_of_item
0,8,5,Cancelled,F,2022-10-20 10:03:00+00:00,NaN,NaN,NaN,3
1,60,44,Cancelled,F,2023-01-20 02:12:00+00:00,NaN,NaN,NaN,1
2,64,46,Cancelled,F,2021-12-06 09:11:00+00:00,NaN,NaN,NaN,1
3,89,65,Cancelled,F,2020-08-13 09:58:00+00:00,NaN,NaN,NaN,1
4,102,76,Cancelled,F,2023-01-17 08:17:00+00:00,NaN,NaN,NaN,2
...,...,...,...,...,...,...,...,...,...
125221,125196,99972,Shipped,M,2022-06-25 11:56:00+00:00,NaN,2022-06-28 08:24:00+00:00,NaN,1
125222,125199,99975,Shipped,M,2022-07-20 02:19:00+00:00,NaN,2022-07-22 11:08:00+00:00,NaN,4
125223,125208,99983,Shipped,M,2022-03-14 15:06:00+00:00,NaN,2022-03-17 05:15:00+00:00,NaN,1
125224,125210,99983,Shipped,M,2023-03-01 15:06:00+00:00,NaN,2023-03-02 10:50:00+00:00,NaN,2
125225,125224,99999,Shipped,M,2023-12-22 11:29:00+00:00,NaN,2023-12-24 00:44:00+00:00,NaN,2

In [276]:
# incorrect date ordering
sum(order_items['created_at'] > order_items['shipped_at'])

35872

In [278]:
# incorrect date ordering
sum(order_items['shipped_at'] > order_items['delivered_at'])

0

In [282]:
# incorrect date ordering
sum(order_items['delivered_at'] > order_items['returned_at'])

0

In [285]:
# redundant sale price
a = order_items.merge(products, left_on = 'product_id', right_on = 'id')
a[a['sale_price'] != a['retail_price']]

Empty DataFrame
Columns: [id_x, order_id, user_id, product_id, inventory_item_id, status, created_at, shipped_at, delivered_at, returned_at, sale_price, id_y, cost, category, name, brand, retail_price, department, sku, distribution_center_id]
Index: []

In [216]:
orders = pd.read_csv("../data/raw/orders.csv")
orders.head()

,order_id,user_id,status,gender,created_at,returned_at,shipped_at,delivered_at,num_of_item
0,8,5,Cancelled,F,2022-10-20 10:03:00+00:00,NaN,NaN,NaN,3
1,60,44,Cancelled,F,2023-01-20 02:12:00+00:00,NaN,NaN,NaN,1
2,64,46,Cancelled,F,2021-12-06 09:11:00+00:00,NaN,NaN,NaN,1
3,89,65,Cancelled,F,2020-08-13 09:58:00+00:00,NaN,NaN,NaN,1
4,102,76,Cancelled,F,2023-01-17 08:17:00+00:00,NaN,NaN,NaN,2

In [276]:
# incorrect date ordering
sum(orders['created_at'] > orders['shipped_at'])

35872

In [278]:
# incorrect date ordering
sum(orders['shipped_at'] > orders['delivered_at'])

0

In [310]:
# incorrect date ordering
sum(orders['delivered_at'] > orders['returned_at'])

0

In [318]:
products = pd.read_csv("../data/raw/products.csv")
products.head()

,id,cost,category,name,brand,retail_price,department,sku,distribution_center_id
0,13842,2.51875,Accessories,Low Profile Dyed Cotton Twill Cap - Navy W39S55D,MG,6.25,Women,EBD58B8A3F1D72F4206201DA62FB1204,1
1,13928,2.33835,Accessories,Low Profile Dyed Cotton Twill Cap - Putty W39S55D,MG,5.95,Women,2EAC42424D12436BDD6A5B8A88480CC3,1
2,14115,4.87956,Accessories,Enzyme Regular Solid Army Caps-Black W35S45D,MG,10.99,Women,EE364229B2791D1EF9355708EFF0BA34,1
3,14157,4.64877,Accessories,Enzyme Regular Solid Army Caps-Olive W35S45D (...,MG,10.99,Women,00BD13095D06C20B11A2993CA419D16B,1
4,14273,6.50793,Accessories,Washed Canvas Ivy Cap - Black W11S64C,MG,15.99,Women,F531DC20FDE20B7ADF3A73F52B71D0AF,1

In [322]:
# clipping number of decimals in cost and retail price
products['retail_price'] = products['retail_price'].round(2)
products['cost'] = products['cost'].round(2)

In [32]:
users = pd.read_csv("../data/raw/users.csv")
users.head()

,id,first_name,last_name,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
0,457,Timothy,Bush,timothybush@example.net,65,M,Acre,87620 Johnson Hills,69917-400,Rio Branco,Brasil,-9.945568,-67.83561,Search,2022-07-19 13:51:00+00:00
1,6578,Elizabeth,Martinez,elizabethmartinez@example.com,34,F,Acre,1705 Nielsen Land,69917-400,Rio Branco,Brasil,-9.945568,-67.83561,Search,2023-11-08 18:49:00+00:00
2,36280,Christopher,Mendoza,christophermendoza@example.net,13,M,Acre,125 Turner Isle Apt. 264,69917-400,Rio Branco,Brasil,-9.945568,-67.83561,Email,2019-08-24 06:10:00+00:00
3,60193,Jimmy,Conner,jimmyconner@example.com,64,M,Acre,0966 Jose Branch Apt. 008,69917-400,Rio Branco,Brasil,-9.945568,-67.83561,Search,2020-02-15 11:26:00+00:00
4,64231,Natasha,Wilson,natashawilson@example.net,25,F,Acre,20798 Phillip Trail Apt. 392,69917-400,Rio Branco,Brasil,-9.945568,-67.83561,Search,2020-03-13 06:45:00+00:00